diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.КоличествоДней = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник) И ЗначениеЗаполнено(Объект.Год) Тогда
		ДнейОтпускаЗапланировано = ДнейОтпускаВБазе(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник, Объект.Год);
		Элементы.ОтпускаСотрудников.ТекущиеДанные.КоличествоДней = ДнейОтпускаЗапланировано + (НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
			- НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала)) / (60 * 60 * 24);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник) И ЗначениеЗаполнено(Объект.Год) Тогда
		ДнейОтпускаЗапланировано = ДнейОтпускаВБазе(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник, Объект.Год);
		Элементы.ОтпускаСотрудников.ТекущиеДанные.КоличествоДней = ДнейОтпускаЗапланировано + (НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
			- НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала)) / (60 * 60 * 24);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрПередачи = ПолучитьТабличныеДанныеДокумента();
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрПередачи", ПараметрПередачи);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ДополнительныеПараметры, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличныеДанныеДокумента()
	
	ТаблицаЗначений = Объект.ОтпускаСотрудников.Выгрузить();
	ТабличныеДанные = Новый ХранилищеЗначения(ТаблицаЗначений);
	СтрокаСериализации = ВКМ_ПолезныеФункции.СериализацияXML(ТабличныеДанные);
	ПараметрПередачи = ЗначениеВСтрокуВнутр(СтрокаСериализации);
	Возврат ПараметрПередачи;

КонецФункции

&НаСервере
Функция ДнейОтпускаВБазе(Сотрудник, Год)
	
	Возврат РегистрыСведений.ВКМ_ГрафикОтпусков.ДнейОтпускаВБазе(Сотрудник, Год);;

КонецФункции

#КонецОбласти
